app/views/groups/_form.html.erb

    <%= f.label :native_language %><br />
    <%= collection_select(:group, :native_language_id, Language.all, :id, :name) %>
---
SELECT "languages".* FROM "languages"