app/views/groups/_groups_table_form.html.erb

      <td>
        <% if group.users.include? current_user  %>
          <%= button_to "Leave", delete_group_user_path(group, current_user) , :confirm => "Are you sure, if you leave group you will later have to be approved again?", :method => :delete, :class => 'btn btn-danger' %>
        <% elsif group.group_join_requests.any? {|gjr| gjr.user == current_user and gjr.status == GroupJoinRequest::S_REQUESTED and gjr.open == true} %>
---
SELECT 1 AS one FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = 1 AND "users"."id" = 4 LIMIT 1
SELECT "group_join_requests".* FROM "group_join_requests" WHERE "group_join_requests"."group_id" = 1 AND "group_join_requests"."user_id" = 4 LIMIT 1
SELECT "groups".* FROM "groups" INNER JOIN "group_users" ON "groups"."id" = "group_users"."group_id" WHERE "group_users"."user_id" = 4
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]