app/views/groups/index.html.erb

      <td>
        <% if group.users.include? current_user  %>
          <%= button_to "Leave", delete_group_user_path(group, current_user) , :confirm => "Are you sure, if you leave group you will later have to be approved again?", :method => :delete, :class => 'btn btn-danger' %>
        <% elsif group.group_join_requests.any? {|gjr| gjr.user == current_user and gjr.status == GroupJoinRequest::S_REQUESTED and gjr.closed == false} %>
---
SELECT 1 AS one FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = 1 AND "users"."id" = 2 LIMIT 1
SELECT "group_join_requests".* FROM "group_join_requests" WHERE "group_join_requests"."group_id" = 2 AND "group_join_requests"."user_id" = 4 LIMIT 1
SELECT "groups".* FROM "groups"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]