app/views/groups/show.html.erb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."group_id" = 1
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."group_id" = 1
---

  <% if !@group.lessons.present? or @group.lessons.count <= 0 %>