app/controllers/group_join_requests_controller.rb

SELECT "users".* FROM "users" INNER JOIN "group_users" ON "users"."id" = "group_users"."user_id" WHERE "group_users"."group_id" = 2
INSERT INTO "group_join_responses" ("created_at", "group_join_request_id", "response", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 04 Apr 2013 21:43:10 UTC +00:00], ["group_join_request_id", 6], ["response", 100], ["updated_at", Thu, 04 Apr 2013 21:43:10 UTC +00:00], ["user_id", 2]]
---
  def create
    @gjr = GroupJoinRequest.new
    @gjr.group_id = @group.id
    @gjr.status = GroupJoinRequest::S_REQUESTED
    @gjr.closed = false
    @gjr.user_id = @user.id

    @gjresponses = []
    @group.users.each do |user|
      @gjresponse = GroupJoinResponse.new
      @gjresponse.user = user
      @gjresponses.push @gjresponse

SELECT "group_join_requests".* FROM "group_join_requests" WHERE "group_join_requests"."id" = ? LIMIT 1  [["id", "7"]]
---
  def find_group_join_request
    @gjr = GroupJoinRequest.find(params[:id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_group
    @group = Group.find(params[:group_id])