app/controllers/group_join_requests_controller.rb

INSERT INTO "group_join_requests" ("created_at", "group_id", "group_user_id", "open", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Thu, 04 Apr 2013 21:43:10 UTC +00:00], ["group_id", 2], ["group_user_id", nil], ["open", true], ["status", 100], ["updated_at", Thu, 04 Apr 2013 21:43:10 UTC +00:00], ["user_id", 4]]
---
  def create
    @gjr = GroupJoinRequest.new
    @gjr.group_id = @group.id
    @gjr.user_id = current_user.id
    @gjr.save