app/controllers/groups_controller.rb

INSERT INTO "group_users" ("created_at", "group_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 04 Apr 2013 21:43:25 UTC +00:00], ["group_id", 3], ["updated_at", Thu, 04 Apr 2013 21:43:25 UTC +00:00], ["user_id", 4]]
INSERT INTO "groups" ("created_at", "foreign_language_id", "name", "native_language_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    #TODO: Perhaps policy that user automatically becomes group's user should perhaps be placed in model
    @group = Group.new(params[:group])
    @group.user = current_user

    respond_to do |format|
      if @group.save