app/controllers/group_users_controller.rb

  def destroy
    @group_user = GroupUser.find_by_user_id_and_group_id(@user.id, @group.id)

    @group_user.destroy
---
SELECT "group_users".* FROM "group_users" WHERE "group_users"."user_id" = 4 AND "group_users"."group_id" = 3 LIMIT 1
DELETE FROM "group_users" WHERE "group_users"."id" = ?  [["id", 9]]

  def find_group
    @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", "3"]]