app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "description", "email", "first_name", "image", "last_name", "name", "nickname", "phone", "provider", "secret", "token", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '216881683' LIMIT 1
---
	def create
		auth = request.env["omniauth.auth"]
		user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)