app/controllers/user_groups_controller.rb

SELECT "groups".* FROM "groups" INNER JOIN "group_users" ON "groups"."id" = "group_users"."group_id" WHERE "group_users"."user_id" = 2
---
  def index
    @groups = @user.groups